# 1 ---------------------------------------------------------------------------
# Задача:
# Ввести массив целых чисел с 
# клавиатуры и вывести их сумму.
z = input()

data = z.split(" ")

for i in range(len(data)):
    data[i] = int(data[i])

print(sum(data))
# 1 ---------------------------------------------------------------------------

# 2 ---------------------------------------------------------------------------
# Задача:
# Ввести с клавиатуры массив целых 
# чисел и найти в нём наибольшее число, 
# которое делится на 2 (такое точно 
# есть во вводе). Вывести его индекс.
z = input()

data = z.split(" ")

max_val = int(data[0])
max_ind = 0

for i in range(1, len(data)):
    val = int(data[i])
    if val > max_val and val % 2 == 0:
        max_ind = i
        max_val = val

print(max_ind)
# 2 ---------------------------------------------------------------------------
